package ubermaster.entityGenerator.entity;

/**
 * @author Serpye
 * */
public interface SQC_DATA
{
	String SQC_NAME[] =
	{
		"Хаскил", "Александр", "Паскаль", "Вадим", "Виктор",
		"Давид", "Дионисий", "Лазарь", "Люциан", "Степан",
		"Ада", "Дайна", "Елизавета", "Ирина", "Лада",
		"Марта", "Мстислава", "Нинель", "Римма", "Юнона"
	};

	String SQC_SURNAME[] =
	{
		"Фандорин", "Трофимов", "Харитонов", "Поляков", "Абдулов",
		"Тихонов", "Гусев", "Карпов", "Марков", "Щукин", "Гаврилов",
		"Вишняков", "Суворов", "Юдин", "Кошелев", "Быков", "Власов",
		"Уваров", "Фролов", "Николаев", "Аксёнов", "Стрелков", "Фокин"
	};

	String SQC_LOCATION[] =
	{
		"Kievskyy", "Primorskyy", "Suvorovskyy", "Malinovskyy"
	};

	String SQC_PROFESSION[] =
	{
		"Программист", "WEB-дизайнер", "Автомеханик", "Адвокат",
		"Аналитик", "Сантехник", "Электрик", "Менеждер по компьютерной технике"
	};

	String SQC_ORDER_NAME[] =
	{
		"Программа по построению графика биржи", "Приложение, что будет считать зависимость расстояния от скорости",
		"Дизайн web-приложения", "Прописать стили web-приложения",
		"Что-то не то с авто", "Нужна помощь с авто",
		"Консультация по адвоката по правовым делам", "Проблема с апеляцией в суде",
		"Когда можно подбирать МосБиржу?", "Хотел бы продать акции Уралкалия в рамках делистинга. Какая процедура и как это осуществить.?",
		"Прорвало трубу в унитазе", "Засорилась мойка, нужна помощь",
		"Нужно поменять счётчик электричества", "электронагреватель не работает",
		"Что лучше HP или ASUS", "Есть ли смысл брать IPhone?"
	};

	String SQC_STATUS[] =
	{
		"New", "In processing", "Completed"
	};

	int ATTR_POKE_SIZE = 7;
	int ATTR_MASTER_SIZE = 15;
	int ATTR_ORDER_SIZE = 9;
}
